# ============================================================
#  config.py  —  ตั้งค่าการเชื่อมต่อฐานข้อมูล MySQL
# ============================================================
#  ★ นิสิตต้องแก้ 4 บรรทัดนี้ให้เป็น user / password ของตัวเอง
#    (ที่อาจารย์แจกให้สำหรับเชื่อมต่อ database server ของวิชา)
# ============================================================

#สามารถ connect เป็น localhost ในเครื่องตัวเองได้
DB_HOST = "localhost"               # TODO: host ที่อาจารย์แจกให้
DB_USER = "root"                     # TODO: username ของนิสิต
DB_PASSWORD = ""                 # TODO: password ของนิสิต
DB_NAME = "db_j.py"              # TODO: ชื่อฐานข้อมูลของนิสิต
DB_PORT = 3306